import { Home } from "@/components/Home";

// Больше создание расписаний
// Добавление больше месяцев
// Авторизация и двух аут. через телеграмм
// привязка телеграмм
// привязка яндекс почты
// при заходе на аккаунт, будет присылаться уведомление на почту или на телеграмм, будет в настройках
// редизайн сайта
// переписать документацию
// изменение расписание после результата
// добавить AI для генерации (внешний api)
// выбор генерации расписание
// улучшить генерацию
// добавить смену темы
// добавить смену языка
// оптимизировать код
// выйти из беты
// добавить поле для генерации AI, комментайрий, где будет написано условие для узкой настройки.
//	добавить админ панель
// добавить для админ панели статистику, по загруженности сайта использование AI или просто, на посещение сайта, просмотр пользователей.
// экспорт испорт json
// второй сайт для проверки api
// сохранение расписание через localStorage или на сервере как решит пользователь
// пошаговое составление расписание (каб. груп. препод.) (карта преп и тд)
// добавление аватарки для профиля
// обновление api-key через подтверждение телеграмм или яндекс почту
// анимации при загруски сайта
// Добавление формы причины отстуствиен преподавателя
// Сделать рас писание поъожее на АПТ

export default function HomePage() {
	return <Home />;
}
